_posts/2021-12-18-abc231-e-upsolving.html
---
title: abc231 E - Minimal payments
tags: DP dfs
toc: true
toc_sticky: true
---

<div id="outline-container-orgb89345c" class="outline-2">
<h2 id="orgb89345c">E - Minimal payments</h2>
</div>

<div id="outline-container-org484aaee" class="outline-2">
<h2 id="org484aaee">접근하기</h2>
<div class="outline-text-2" id="text-org484aaee">
<pre class="example">
X = 87
A = (1,10,100)

100 - 87 = 13     // 100내기(1), 13받기
10                // 10받기(1)
1
1
1                // 3받기(3)

총 5개가 답
</pre>
</div>
</div>
<div id="outline-container-org94ddbe5" class="outline-2">
<h2 id="org94ddbe5">코드 - 반복문 풀이</h2>
<div class="outline-text-2" id="text-org94ddbe5">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">x</span>;
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">a</span>[65];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %lld"</span>, &amp;N, &amp;x);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%lld"</span>, &amp;a[i]);
    } 

    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">ans</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=N;i&gt;=1;i--)
    {
        <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">k</span> = x%a[i];     <span style="color: #888a85;">// </span><span style="color: #888a85;">87</span>
        <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">r</span> = a[i]-k;   <span style="color: #888a85;">// </span><span style="color: #888a85;">13</span>
        <span style="color: #729fcf; font-weight: bold;">if</span> (k-r &lt; a[i-1]) {
            ans += x/a[i];
            x = k;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            ans += x/a[i] + 1;
            x = r;
        }
    } 
    printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, ans);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd16bbfd" class="outline-2">
<h2 id="orgd16bbfd">코드 - dfs이용</h2>
<div class="outline-text-2" id="text-orgd16bbfd">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">x</span>;
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">a</span>[65];

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #edd400; font-weight: bold;">dfs</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>, <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">x</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (idx == 1) <span style="color: #729fcf; font-weight: bold;">return</span> x;

    <span style="color: #8ae234; font-weight: bold;">ll</span>   <span style="color: #ff6347;">cnt</span> = x / a[idx];         <span style="color: #888a85;">// </span><span style="color: #888a85;">&#54788;&#51116;yen &#47751;&#44060;&#46300;&#45716;&#51648;</span>
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">case1</span> = x % a[idx];         <span style="color: #888a85;">// </span><span style="color: #888a85;">87 % 100 = 87</span>
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">case2</span> = a[idx] - case1;     <span style="color: #888a85;">// </span><span style="color: #888a85;">100 - 87 = 13</span>

    <span style="color: #729fcf; font-weight: bold;">if</span> (case1 - case2 &lt; a[idx-1])       <span style="color: #888a85;">// </span><span style="color: #888a85;">&#51060; &#49885;&#51012; &#49373;&#44033;&#54616;&#44592; &#50612;&#47140;&#50880;</span>
        <span style="color: #729fcf; font-weight: bold;">return</span> dfs(idx-1, case1) + cnt;
    <span style="color: #729fcf; font-weight: bold;">else</span>
        <span style="color: #729fcf; font-weight: bold;">return</span> dfs(idx-1, case2) + cnt + 1;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %lld"</span>, &amp;N, &amp;x);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%lld"</span>, &amp;a[i]);
    } 

    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">ret</span> = dfs(N, x);
    printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, ret);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b73d80" class="outline-2">
<h2 id="org0b73d80"><span class="todo TODO">TODO</span> 코드 - DP풀이</h2>
</div>
<div id="outline-container-org89b25ad" class="outline-2">
<h2 id="org89b25ad">문제 링크</h2>
<div class="outline-text-2" id="text-org89b25ad">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc231/tasks/abc231_e">https://atcoder.jp/contests/abc231/tasks/abc231_e</a></li>
</ul>
</div>
</div>
